clear all
load x.mat
ph = x;
% 50 50 8.5 8.5 0 0.0 0.0 
% 201 201 0.06 0.06 0 0.0 0.0
% p1=sqrt(x1^2+y1^2);
[x,y]=meshgrid(-2:0.01:2);
z=sqrt(x.^2+y.^2)/2;
% if z>=0.4294
%     z=0.1549;
% else
%     z=3.29;
% end   [0.234039039219382,0.479751842472759,3.89289840744850,0.0251475378722961,2.79927246885138][0.408598945208893,0.784037272585859,0.159200696125498,2.92745525560337,1.90249458246812]
circ_mask=zeros(401,401)+ph(1,3);  
% circ_mask(find(z<=0.4294))=3.29;  %找到圆内的元素，并复制为1
% circ_mask(find(z>0.4294))=0.1549;   %找到圆外的元素，并复制为0

circ_mask(find(z<=ph(1,1)))=ph(1,4);  %找到圆内的元素，并复制为1
% circ_mask(find(0.234039039219382<z<0.479751842472759))=0.0251475378722961;   %找到圆外的元素，并复制为0
circ_mask(find(z>=ph(1,2)))=ph(1,5); 
% z(z>=0.4294)=0.1549;
% z(z<0.4294)=3.29;
z=circ_mask';
surf(z)
shading interp

z=z(:);
%  z=34.0339*(x1^2+y1^2).^(3/2)-47.9093*(x1^2+y1^2)+13.8754*sqrt(x1^2+y1^2);
% z=(2311.*sin((391.*pi.*(x.^2 + y.^2).^(1/2))/500))/500;
n=401;
Dx=zeros(n^2,1);
Dy=zeros(n^2,1);
Dxy=zeros(n^2,1);
nodata=zeros(n^2,1);
Sur=[z Dx Dy Dxy nodata];


save 1.dat -ascii Sur
